import type {ICard} from "./types/card"
import type {IPlan, IPlanView} from "./types/plan"

export const BEST_PLAN = "3 мес"
export const TELEGRAM_BOT_URL = "https://t.me/vpn_portbot"

const PLANS: IPlanView[] = [
    {
        "name": "1 мес",
        "price": 149,
        "oldPrice": 199,
        "discount": 25,
    },
    {
        "name": "3 мес",
        "price": 374,
        "oldPrice": 499,
        "discount": 25,
        "is_best": true
    },
    {
        "name": "6 мес",
        "price": 749,
        "oldPrice": 999,
        "discount": 25,
    },
    {
        "name": "12 мес",
        "price": 1499,
        "oldPrice": 1999,
        "discount": 25,
    }
]
const FEATURES: ICard[] = [
    {
        title: "🛡️ Технология VLESS",
        description: "Провайдер не видит, что вы используете прокси, и не может его заблокировать",
        iconStyles: ""
    },
    {
        title: "☁️ «Белые списки»",
        description: "Стабильная связь даже в регионах с «суверенным интернетом»",
        iconStyles: ""
    },
    {
        title: "✈️ Прямой канал",
        description: "Минимальный пинг и отсутствие посредников. Вы подключаетесь напрямую к высокоскоростным узлам",
        iconStyles: ""
    }
]

const CARDS: ICard[] = [
    {
        title: "YouTube в 4K",
        description: "Смотрите видео в максимальном качестве \nбез пауз и буферизации",
        icon: "custom:youtube",
        iconStyles: ""
    },
    {
        title: "Соцсети",
        description: "Запрет-gram*, Face-книжка, WhatsApp и TikTok \nоткрываются мгновенно, как раньше",
        icon: "custom:whatsup",
        iconStyles: ""
    },
    {
        title: "Telegram",
        description: "Стабильная работа мессенджера \nи быстрая загрузка медиафайлов",
        icon: "custom:ntg",
        iconStyles: ""
    },
    {
        title: "Быстрый",
        description: "Любые сайты и сервисы \nзагружаются с первого раза",
        icon: "custom:hw",
        iconStyles: ""
    },
]
const AI_CARDS: ICard[] = [
    {
        title: "🤖 ChatGPT & Claude",
        description:
            "Забудьте про ошибки «Access Denied» и постоянные разлогины. Работайте с топовыми чат-ботами без ограничений",
    },
    {
        title: "🎨 Midjourney",
        description:
            "Максимальная скорость загрузки и генерации изображений",
    },
    {
        title: "☂️ Никаких капч",
        description:
            "Наши прокси имеют высокую репутацию. Сервисы видят в вас реального пользователя, а не подозрительный бот-трафик",
    },
]

const OUR_APP_CARDS = [
    {
        bold: "Никаких «отвалов» и «разрывов»:",
        text:
            "Мы создаем \nархитектуру, которая держит соединение железно",
    },
    {
        bold: "Умный выбор:",
        text:
            "приложение будет автоматически\nнаходить и переключаться на лучшие сервера в\nреальном времени, чтобы у вас всё летало",
    },
    {
        bold: "Везде и сразу:",
        text: "Релиз состоится одновременно на \niOS, Android, Windows и macOS"
    }
]
export {CARDS, FEATURES, AI_CARDS, OUR_APP_CARDS, PLANS}